{
  "backend/main.mo": "Motoko canister implementing access control, user profiles, projects, tasks, preferences, and related utility types and state.",
  "feature_evidence.json": "Feature evidence report listing PWA, service worker, and manifest requirements with associated files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing roles of key frontend React components, hooks, styles, and views.",
  "frontend/index.html": "Main HTML entry defining PWA meta tags, icons, manifest reference, and bootstrapping the React app.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata, colors, start behavior, and icon assets including proper 32, 192, and 512 PNGs.",
  "frontend/public/service-worker.ts": "Custom service worker implementing precaching, runtime caching, navigation fallback, and exclusions for canister API calls.",
  "frontend/src/App.tsx": "Root React component handling authentication, routing between calendar and project views, dark theme, and service worker registration.",
  "frontend/src/components/CreateProjectDialog.tsx": "Dialog component for creating a project with name, icon, and color selection and form submission via useCreateProject.",
  "frontend/src/components/CreateTaskDialog.tsx": "Dialog for creating a task with fields for title, description, date, project, and priority, submitting through useCreateTask.",
  "frontend/src/components/EmptyState.tsx": "Displays empty-state UI for no projects or tasks, optionally showing a create-project dialog launcher.",
  "frontend/src/components/Header.tsx": "App header providing navigation, date controls, view switching, user menu, and mobile drawer handling.",
  "frontend/src/components/HistoryPage.tsx": "Displays searchable, sorted list of completed tasks with project info and task selection callback.",
  "frontend/src/components/InstallPrompt.tsx": "Manages and displays PWA install prompts, handling browser and iOS install flows and user dismissal.",
  "frontend/src/components/LoginScreen.tsx": "Renders a branded login screen with marketing features and an Internet Identity login button.",
  "frontend/src/components/LongFormTaskEditor.tsx": "Provides a rich text editor for long-form task descriptions using ReactQuill.",
  "frontend/src/components/MainContent.tsx": "Switches between day, week, and month calendar views based on the current view mode.",
  "frontend/src/components/OverviewPage.tsx": "Displays productivity insights and project statistics with loading and empty states.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for entering and saving a user's display name on first setup.",
  "frontend/src/components/ProjectsOverview.tsx": "Shows all projects, supports expansion, deletion, and creation, and lists associated tasks.",
  "frontend/src/components/Sidebar.tsx": "Empty file.",
  "frontend/src/components/TaskCard.tsx": "Displays a task card with completion toggle, edit and delete actions, and optional selection handling.",
  "frontend/src/components/TaskDrawer.tsx": "Side drawer listing active tasks with search, quick-add, and task selection, using project lookups and task-creation mutations.",
  "frontend/src/components/TaskEditDialog.tsx": "Dialog for editing a task’s title, description, due date, project, and priority, submitting updates via mutations.",
  "frontend/src/components/TaskPage.tsx": "Full-page task editor supporting title, content, due date, priority, project changes, and saving via API mutations.",
  "frontend/src/components/views/DayView.tsx": "Daily task view grouping overdue, upcoming, and completed tasks, with sorting, selection, and task creation.",
  "frontend/src/components/views/MonthView.tsx": "Monthly calendar rendering tasks per day, with priority sorting, overdue indicators, day navigation, and task creation.",
  "frontend/src/components/views/WeekView.tsx": "Weekly grid view showing tasks per day with overdue detection, sorting, selection, and task creation.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on Internet Identity, reinitializing and invalidating queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, logout, stored identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for interacting with backend tasks, projects, and user profile using the authenticated actor.",
  "frontend/src/index.css": "Tailwind CSS base styles and custom theme variables, plus styling for scrollbars and a rich‑text editor.",
  "frontend/src/main.tsx": "App bootstrap that sets up React Query and Internet Identity providers before rendering the app.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, animations, and plugins including typography and container queries.",
  "frontend/vite.config.ts": "Vite configuration enabling React, aliasing, custom service worker output, and dev server settings.",
  "project_state.json": "Defines project metadata and requirements focused on completing PWA support and fixing service worker and manifest issues."
}