{
  "backend/main.mo": "Actor implementing access control, user profiles, projects, tasks, preferences, and various statistics with permission checks and ordered-map storage.",
  "backend/migration.mo": "Migration module converting old task structures to new nullable projectId format while preserving all other actor state.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files and components with test references.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend source files describing major components, views, and hooks.",
  "frontend/index.html": "HTML entrypoint configuring metadata, icons, manifest, and bootstrapping the main React app.",
  "frontend/public/manifest.json": "PWA manifest defining metadata, icons, theme colors, and startup configuration.",
  "frontend/public/service-worker.ts": "Service worker implementing precaching, runtime caching, cache cleanup, and offline fallback logic.",
  "frontend/src/App.tsx": "Main React app component handling authentication, section routing, theme setup, service worker registration, and global layout.",
  "frontend/src/components/CreateProjectDialog.tsx": "Dialog component for creating a new project with name, icon, and color selection, submitting via useCreateProject.",
  "frontend/src/components/CreateTaskDialog.tsx": "Form dialog to create a task with title, description, due date, project selection, and priority, using backend mutation hooks.",
  "frontend/src/components/EmptyState.tsx": "Displays empty-state messaging for no projects or tasks and optionally opens the CreateProjectDialog.",
  "frontend/src/components/Header.tsx": "Responsive header managing navigation, date controls, view modes, drawer toggle, and user profile/logout menu.",
  "frontend/src/components/HistoryPage.tsx": "Shows completed tasks with search, sorting, project lookup, and optional task selection callback.",
  "frontend/src/components/InstallPrompt.tsx": "Manages PWA install prompts for different platforms, handling dismissal, installation, and display logic.",
  "frontend/src/components/LoginScreen.tsx": "Presents a branded login screen with feature highlights and an Internet Identity authentication button.",
  "frontend/src/components/LongFormTaskEditor.tsx": "Provides a rich text editor for long-form task content using ReactQuill with a configured toolbar.",
  "frontend/src/components/MainContent.tsx": "Renders day, week, or month views based on the selected view mode and passes date/task interaction props.",
  "frontend/src/components/OverviewPage.tsx": "Fetches and displays productivity insights, stats, and loading states with various summary cards.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal prompting the user to enter their name and save their profile via a mutation.",
  "frontend/src/components/ProjectsOverview.tsx": "Shows a list of projects with expand/collapse, task fetching, project actions, and project creation dialog.",
  "frontend/src/components/Sidebar.tsx": "Empty placeholder component with no implemented content.",
  "frontend/src/components/TaskCard.tsx": "Displays a task card with completion toggle, edit/delete actions, task metadata, and optional selection behavior.",
  "frontend/src/components/TaskDrawer.tsx": "Sidebar drawer listing active tasks with search, quick-add, and selection; integrates task creation and project lookup.",
  "frontend/src/components/TaskEditDialog.tsx": "Modal dialog for editing a task’s fields including title, description, due date, project, and priority.",
  "frontend/src/components/TaskPage.tsx": "Full-page task editor showing details and long-form content with save handling and project display.",
  "frontend/src/components/views/DayView.tsx": "Displays tasks for a single day grouped by overdue, upcoming, and completed, with task creation support.",
  "frontend/src/components/views/MonthView.tsx": "Renders a month calendar grid with per‑day task previews, overdue indicators, and day/task navigation.",
  "frontend/src/components/views/WeekView.tsx": "Shows a week-by-day layout with tasks sorted by priority and date, plus quick task creation.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on the current Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity auth client state, login flow, and stored identities.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for calling backend APIs for user profiles, projects, and tasks, using the current actor and auto‑invalidating caches.",
  "frontend/src/index.css": "Tailwind base styles plus custom CSS variables, dark mode rules, scrollbar styling, and Quill editor styling overrides.",
  "frontend/src/main.tsx": "Initializes React app with QueryClientProvider and InternetIdentityProvider and loads global styles.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, themes, animations, and plugins such as typography and container queries.",
  "project_state.json": "Project metadata describing requirements and planned features for supporting unassigned tasks and default dates in quick-add flow."
}