{
  "backend/main.mo": "Actor managing access control, user profiles, projects, tasks, and associated stats using OrderedMap and role‑based permission checks.",
  "feature_evidence.json": "Feature evidence report linking two optimistic‑UI React Query features to the file useQueries.ts with metadata and confidence levels.",
  "frontend-file-summaries.txt": "JSON-like listing summarizing the purpose of each major frontend file, including components, hooks, and styling.",
  "frontend/index.html": "Base HTML entry point setting up PWA metadata, icons, manifest, and loading the main React script.",
  "frontend/public/manifest.json": "PWA manifest defining app name, colors, icons, start URL, and display settings.",
  "frontend/public/service-worker.ts": "Service worker handling precaching, runtime caching, navigation fallback, and cache cleanup for offline support.",
  "frontend/src/App.tsx": "Main React app component handling authentication, section navigation, task page routing, dark mode, and service worker registration.",
  "frontend/src/components/CreateProjectDialog.tsx": "Dialog component for creating a new project with name, icon, and color selection, submitting via useCreateProject.",
  "frontend/src/components/CreateTaskDialog.tsx": "Dialog for creating tasks with title, description, date, project assignment, and priority using useCreateTask.",
  "frontend/src/components/EmptyState.tsx": "Displays empty-state UI for no projects or tasks and provides a project creation button when applicable.",
  "frontend/src/components/Header.tsx": "Responsive header with navigation controls, date navigation, user menu, and section switching.",
  "frontend/src/components/HistoryPage.tsx": "Page showing searchable, sorted history of completed tasks with project info and task click handling.",
  "frontend/src/components/InstallPrompt.tsx": "PWA install prompt logic handling browser events, iOS fallback, and user dismissal or acceptance.",
  "frontend/src/components/LoginScreen.tsx": "Renders the login screen with hero branding, feature cards, and a button that triggers Internet Identity authentication.",
  "frontend/src/components/LongFormTaskEditor.tsx": "Provides a rich text editor for long-form task descriptions using ReactQuill with custom toolbar options.",
  "frontend/src/components/MainContent.tsx": "Chooses and displays the day, week, or month view based on the current view mode and selected date.",
  "frontend/src/components/OverviewPage.tsx": "Displays productivity insights and statistics, loading states, and fallback messaging when no data is available.",
  "frontend/src/components/ProfileSetupModal.tsx": "Shows a modal prompting the user to enter and save their display name during initial setup.",
  "frontend/src/components/ProjectsOverview.tsx": "Lists all projects with expand/collapse behavior, project creation, deletion, and nested task listings.",
  "frontend/src/components/Sidebar.tsx": "Empty file placeholder for the sidebar component.",
  "frontend/src/components/TaskCard.tsx": "Displays an individual task with completion toggling, editing, deletion, drag handle support, and overdue styling.",
  "frontend/src/components/TaskDrawer.tsx": "Sidebar drawer listing active tasks with search, quick-add, and selection handling. Fetches tasks and projects, filters by search, and allows creating and selecting tasks.",
  "frontend/src/components/TaskEditDialog.tsx": "Dialog for editing a task’s title, description, due date, project, and priority. Saves updates through mutation hooks and syncs state when opened.",
  "frontend/src/components/TaskPage.tsx": "Full-page task editor with long-form content, due date, project selection, and priority controls. Loads a task, tracks unsaved changes, and saves updates via API mutations.",
  "frontend/src/components/views/DayView.tsx": "Displays tasks for a single day grouped into overdue, upcoming, and completed, with sorting by priority. Supports opening tasks and creating new ones.",
  "frontend/src/components/views/MonthView.tsx": "Monthly calendar view showing tasks per day with indicators for overdue and priority ordering. Allows selecting days or opening the first task of a day.",
  "frontend/src/components/views/WeekView.tsx": "Weekly grid showing tasks for each day sorted by priority and overdue status. Supports selecting tasks and creating new tasks via a floating button.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login/logout methods, and initializes AuthClient with stored identities.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, projects, and tasks using the authenticated actor.",
  "frontend/src/index.css": "Global Tailwind-based styles including color variables, dark mode, scrollbar styling, and Quill editor customization.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider and loads global styles.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, themes, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing optimistic UI goals for task completion and known flicker issues."
}