{
  "kind": "build_request",
  "title": "Fix task completion checkbox flicker with reliable optimistic updates",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Eliminate the completion-toggle flicker by making task completion changes apply immediately (optimistic UI) across all UI locations that can mark a task complete/incomplete (e.g., TaskCard in Day/Week/Month views and any other list using React Query task caches).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "i click, it changes as it should, it flickers to the original, then returns to what should be, so i want to remove this flicker brother"
        ]
      },
      "acceptanceCriteria": [
        "When clicking a task completion checkbox, the checkbox and any completion-dependent styling (e.g., strikethrough/opacity) updates immediately and does not visually revert to the previous state at any point.",
        "The fix applies consistently anywhere tasks can be checked/unchecked (not just a single page/component)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the React Query optimistic update logic for completion toggling so that it synchronously updates all relevant cached queries (all queries whose keys start with ['tasks', ...] and the individual ['task', taskId] cache if present) before any potential refetch/overwrite can cause a brief reversion.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "i want to have optimistic, which i think it should be there already but need to fix it\nHappens on all places"
        ]
      },
      "acceptanceCriteria": [
        "Toggling completion updates cached task data for: (1) all task list queries (dateRange, project, completion, history, etc. where applicable) and (2) the single-task query cache when it exists.",
        "No intermediate render occurs where the UI shows the old completion state after the click while the mutation is in-flight.",
        "If the mutation fails, the UI rolls back to the previous state and remains consistent with the server after the subsequent refetch."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend immutablePaths (e.g., frontend/src/hooks/useActor.ts, frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/main.tsx, frontend/src/components/ui).",
    "Backend remains single-actor; do not introduce new canisters/services."
  ],
  "nonGoals": [
    "Building a new Habit page or adding new habit features.",
    "Changing backend task-completion semantics or adding new backend endpoints."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}