{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix task completion checkbox flicker via robust React Query optimistic updates",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Ensure task completion toggles update immediately (optimistic UI) without flicker anywhere tasks are checked/unchecked.",
      "acceptanceCriteria": [
        "When clicking a task completion checkbox, the checkbox and any completion-dependent styling (e.g., strikethrough/opacity) updates immediately and does not visually revert to the previous state at any point.",
        "The fix applies consistently anywhere tasks can be checked/unchecked (not just a single page/component)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Harden useToggleTaskCompletion optimistic update behavior so UI state flips immediately and remains stable while the mutation is in-flight: (1) synchronously apply optimistic changes, (2) cancel in-flight task-related queries to prevent overwrites, (3) rollback on error, (4) refetch after settle to reconcile with backend."
        },
        {
          "path": "frontend/src/components/TaskCard.tsx",
          "operation": "modify",
          "description": "Update TaskCard completion toggle invocation to provide enough information for reliable optimistic updates (e.g., current/next completion state) and ensure the checkbox + completion styling are driven by React Query cache state without any intermediate revert."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Update optimistic completion toggling to synchronously update all task-related React Query caches (all ['tasks', ...] queries and ['task', taskId]) and rollback correctly on failure.",
      "acceptanceCriteria": [
        "Toggling completion updates cached task data for: (1) all task list queries (dateRange, project, completion, history, etc. where applicable) and (2) the single-task query cache when it exists.",
        "No intermediate render occurs where the UI shows the old completion state after the click while the mutation is in-flight.",
        "If the mutation fails, the UI rolls back to the previous state and remains consistent with the server after the subsequent refetch."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Revise useToggleTaskCompletion onMutate to synchronously update all relevant caches before any refetch can overwrite: update every cached query whose key starts with ['tasks', ...] (including completion/history variants) and also update ['task', taskId] when present; cancel in-flight queries for both ['tasks'] and ['task', taskId] to prevent stale writes; store snapshots for rollback; onError restore snapshots; onSettled invalidate/refetch relevant task queries so final state matches backend."
        }
      ]
    }
  ]
}