{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Task app: quick-add from side menu should create tasks without requiring a project, default date to today, and remain fast/effective; users can assign a project and change date later.",
  "architectural_notes": [
    "Quick-add task flow (side menu) must not require project assignment; tasks default to no project and date=today, with later edits allowed."
  ],
  "known_issues": [],
  "isFixRequest": true,
  "existing_features": [
    {
      "id": "feature-change-the-side-menu-quick-add-flow-in-the-task-drawer-frontend-src-components-taskdrawer-tsx-so-it-does-not-require-any-projects-to-exist-does-not-auto-assign-a-default-project-and-creates-the-task-with-due-date-set-to-today-by-default",
      "title": "Change the side-menu quick-add flow in the task drawer (frontend/src/components/TaskDrawer.tsx) so it does not require any projects to exist, does not auto-assign a default project, and creates the task with due date set to today by default.",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    },
    {
      "id": "feature-ensure-users-can-assign-a-project-later-for-an-unassigned-task-via-existing-task-editing-ui-by-wiring-the-project-selector-to-the-backend-api-that-updates-a-task-s-project-so-selecting-a-project-actually-persists",
      "title": "Ensure users can assign a project later for an unassigned task via existing task editing UI, by wiring the project selector to the backend API that updates a task’s project (so selecting a project actually persists).",
      "reqIds": [
        "REQ-4"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Update side-menu quick add: project not mandatory (default none), set task date to today, keep creation fast; allow later project/date edits",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Update the backend Task model and APIs to support tasks with no project assigned (unassigned tasks), while preserving existing ownership/permission checks and allowing a project to be assigned later.",
      "reqIds": [
        "REQ-1"
      ],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Add a conditional Motoko migration (backend/migration.mo) to safely upgrade existing deployed state to the updated Task model that supports unassigned tasks (ensuring existing tasks retain their current project assignment).",
      "reqIds": [
        "REQ-2"
      ],
      "status": "pending"
    }
  ],
  "projectName": "Make side-menu quick-add create tasks without a project and default due date to today",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}